read_uhdm -debug top.uhdm
write_json
prep -top \top
write_verilog
write_verilog yosys.sv
sim -clock conntb.drive -rstlen 10 -vcd dump.vcd
