plugin -i uhdm
read_uhdm -debug top.uhdm
prep -top \top
write_verilog
write_verilog yosys.sv
select -module top
sat -verify -seq 1 -tempinduct -prove-asserts -show-all
sim -rstlen 10 -vcd dump.vcd
