read_uhdm -debug top.uhdm
write_json
prep -top \work_top
write_verilog
write_verilog yosys.sv
sim -rstlen 10 -vcd dump.vcd
