read_uhdm top.uhdm
write_json
prep -top \work_dut
write_verilog
write_verilog yosys.sv
sim -clock i -rstlen 10 -vcd dump.vcd
