read_uhdm -debug dut.uhdm
synth_xilinx
write_json
write_verilog
write_verilog yosys.sv
select -assert-count 1 \dut/gen_modules[1].module_in_genscope
select -assert-count 1 \dut/gen_modules[0].module_in_genscope
