read_uhdm -debug dut.uhdm
prep -top \ibex_cs_registers
write_json
write_verilog
write_verilog yosys.sv
sat -verify -seq 100 -tempinduct -prove-asserts -show-all
