read_uhdm -debug dut.uhdm
prep -top \dut
write_json
write_verilog
write_verilog yosys.sv
sat -verify -seq 100 -tempinduct -prove-asserts -show-all
